/** @type {import('tailwindcss').Config} */
module.exports = {
  content: ["./**/*.{html,js,php}"],
  theme: {
    extend: {
      colors: {
        'broom': {
            '50': '#fdffe7',
            '100': '#f8ffc1',
            '200': '#f6ff86',
            '300': '#f9ff41',
            '400': '#fffc0d',
            '500': '#fbea00', //指定カラー
            '600': '#d1b100',
            '700': '#a68002',
            '800': '#89630a',
            '900': '#74510f',
            '950': '#442b04',
        },
        'shark': {
            '50': '#f5f5f6',
            '100': '#e6e6e7',
            '200': '#cfd0d2',
            '300': '#adaeb3',
            '400': '#84858c',
            '500': '#696a71',
            '600': '#5a5b60',
            '700': '#4c4c52',
            '800': '#434347',
            '900': '#3b3b3e',
            '950': '#1f1f21', //指定カラー
        },


      }
    },
  },
  plugins: [],
}

